Autodesk.Revit.DB.Electrical.PanelConfiguration
This enum declares the configuration for given panel schedule type.
Since:
2011

Autodesk.Revit.DB.Electrical.PanelConfiguration.TwoColumnsCircuitsDown
Circuits are numbered top-to-bottom in one single column. First circuits down the left side, then the right side.

Autodesk.Revit.DB.Electrical.PanelConfiguration.TwoColumnsCircuitsAcross
Circuits are numbered left-to-right. The odd circuits down the left side, even circuits down the right side.

Autodesk.Revit.DB.Electrical.PanelConfiguration.OneColumn
Circuits are numbered top-to-bottom in one single column.